** TODO Revise CSI OER brochure 
:LOGBOOK:
CLOCK: [2019-08-06 Tue 09:17]--[2019-08-06 Tue 16:29] =>  7:12
CLOCK: [2019-07-10 Wed 09:56]--[2019-07-10 Wed 09:59] =>  0:03
:END:

- Note taken on [2019-07-30 Tue 11:58] \\
  emailed Janice for hi res photo of library. 
  emailed print services to check on dimensions
*** DONE Find old brochure --
:LOGBOOK:
CLOCK: [2019-07-10 Wed 09:59]--[2019-07-10 Wed 10:55] =>  0:56
:END:
the AI file was in my dropbox...
**** TODO sketch out new brochure ideas
:LOGBOOK:
CLOCK: [2019-07-16 Tue 09:12]--[2019-07-16 Tue 09:43] =>  0:31
:END:

** Admin
:LOGBOOK:
CLOCK: [2019-07-30 Tue 09:21]--[2019-07-30 Tue 09:22] =>  0:01
:END:
- CSI libguide pw: csi email, rZ
- FLAS pw: mu3tarjim.
- [2019-07-30 Tue 13:47] I mean...i can't seem to get anything done. Why. 
